int nowage(int *pa,int *pb,int *pc,int *pd,int *pe)
{/*通过数学算法计算出爷孙俩现在的年龄，并通过指针返回再过几年的年数*/
int x,y,a,b,c,d,e;
 for(x=6;x<=14;x++)			/*从孙子的年龄6岁到14岁算起*/
   for(a=1;a<=100;a++)		/*再过a年的范围*/
   for(b=a+1;b<=100;b++)		/*再过b年的范围*/
   for(c=b+1;c<=100;c++)
   for(d=c+1;d<=100;d++)
   for(e=d+1;e<=100;e++)   
	   if(6*(x+a)==7*x+a&&
        5*(x+b)==7*x+b&&
        4*(x+c)==7*x+c&&
	3*(x+d)==7*x+d&&
	2*(x+e)==7*x+e)			/*需满足数学公式*/
	   {
		   *pa=a;*pb=b;*pc=c;*pd=d;*pe=e;/*指针指向再过几年*/	
		   return x;					/*返回x，即孙子的年龄*/
	   }  

}
qxn()			/*计算前些年*/
{
	float y,s,a,z,b,c,d,e;
	int h,i,k=0;
	s=nowage(&a,&b,&c,&d,&e);		/*孙子的年龄*/
	y=7*s;							/*爷爷的年龄*/
	h=(int)(s-1);					/*强制转换*/
	for(i=h;i>=1;i--)				/*遍历孙子的年龄*/
	{y--;
	s--;
		z=y/s;						/*爷孙年龄倍数*/
		k++;
		if(z==(int)z)				/*是否整除*/
		
			printf("\n%d年前,爷爷的年龄是%3.0f岁,孙子的年龄是%3.0f岁,爷爷是孙子年龄的%3.0f倍！",k,y,s,z);
	}
printf("\n");
}

main()
{int x,a,b,c,d,e;
 x=nowage(&a,&b,&c,&d,&e);			/*调用爷孙现在的年龄*/
 /*通过返回的指针和孙子现在的年龄输出信息*/
 printf("\n爷爷现在的年龄是%d，孙子现在的年龄是%d,爷爷的年龄是孙子的7倍！\n",7*x,x);
 printf("\n再过%d年，爷爷的年龄为%d岁，孙子的年龄为%d岁，爷爷是孙子的6倍！",a,7*x+a,x+a);
 printf("\n再过%d年，爷爷的年龄为%d岁，孙子的年龄为%d岁，爷爷是孙子的5倍！",b,7*x+b,x+b);
 printf("\n再过%d年，爷爷的年龄为%d岁，孙子的年龄为%d岁，爷爷是孙子的4倍！",c,7*x+c,x+c);
 printf("\n再过%d年，爷爷的年龄为%d岁，孙子的年龄为%d岁，爷爷是孙子的3倍！",d,7*x+d,x+d);
 printf("\n再过%d年，爷爷的年龄为%d岁，孙子的年龄为%d岁，爷爷是孙子的2倍！\n\n",e,7*x+e,x+e);
 qxn();
 getch();
}


 

   	 

